README.md

# Table of Contents

1.  [TODOs](#orgcf9c2e5)
    1.  [Figure out if it&rsquo;s possible to generate missing characters (diacritics, etc) using the Hershey-Noailles source package or otherwise.](#org367747c)
    2.  [Add other chart types to stylesheet.](#org2af3085)

This package bundles [Hershey-Noailles](https://gitlab.com/Luuse/Villa-Noailles/font-hershey-noailles) fonts with a matplotlib stylesheet to give a vintage black-and-white look to plots. Currently it only does line and scatter plots.

Hershey-Noailles fonts are created by Luuse and licensed under the SIL Open Font License 1.1, which allows redistribution of fonts as long as they are bundled with code. The requisite code in this package is the `vintage_sciplots.mplstyle` stylesheet.


<a id="orgcf9c2e5"></a>

# TODOs


<a id="org367747c"></a>

## [ ] Figure out if it&rsquo;s possible to generate missing characters (diacritics, etc) using the Hershey-Noailles source package or otherwise.


<a id="org2af3085"></a>

## [ ] Add other chart types to stylesheet.

